stress-tests/websocket-quick.yml
# Quick WebSocket test - runs in ~20 seconds
# Good for smoke testing during development

config:
  target: "ws://localhost:8000"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Quick test"

scenarios:
  - name: "Quick WebSocket Connection"
    engine: ws
    flow:
      - connect: "ws://localhost:8000/ws/market_pairs"
      - think: 2
      - send: "ping"
      - think: 5